Repository: lxd930808/LinguaCast
Catalog: ios/PodcastEnglishStudio/PodcastEnglishStudio/Support/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, ja, ko, pt_br, zh_hans, zh_hant

# ytvideo_player.playback_speed
source: Playback speed
ar: سرعة التشغيل
de: Wiedergabegeschwindigkeit
es: Velocidad de reproducción
fr: Vitesse de lecture
ja: 再生速度
ko: 재생 속도
pt_br: Velocidade de reprodução
zh_hans: 播放速度
zh_hant: 播放速度

# ytvideo_player.playback_speed_normal
source: Normal
ar: عادي
fr: Normale
ja: 標準
ko: 표준
zh_hans: 正常
zh_hant: 正常

# ytvideo_player.previous_sentence
source: Previous sentence
ar: الجملة السابقة
de: Vorheriger Satz
es: Frase anterior
fr: Phrase précédente
ja: 前の文
ko: 이전 문장
pt_br: Frase anterior
zh_hans: 上一句
zh_hant: 上一句

# ytvideo_player.quality
source: Quality
ar: الجودة
de: Qualität
es: Calidad
fr: Qualité
ja: 画質
ko: 화질
pt_br: Qualidade
zh_hans: 清晰度
zh_hant: 清晰度

# ytvideo_player.quality_auto_default
source: Auto (Default)
ar: تلقائي (افتراضي)
de: Auto (Standard)
es: Automático (predeterminado)
fr: Auto (par défaut)
ja: 自動（デフォルト）
ko: 자동(기본값)
pt_br: Automático (padrão)
zh_hans: 自动（默认）
zh_hant: 自動（預設）

# ytvideo_player.quality_auto_hls
source: Auto · HLS
ar: تلقائي · HLS
de: Automatisch · HLS
es: Automático · HLS
ja: 自動 · HLS
ko: 자동 · HLS
pt_br: Automático · HLS
zh_hans: 自动 · HLS
zh_hant: 自動 · HLS

# ytvideo_player.replay_current_sentence
source: Replay current sentence
ar: إعادة الجملة الحالية
de: Aktuellen Satz wiederholen
es: Repetir la frase actual
fr: Rejouer la phrase actuelle
ja: 現在の文をもう一度再生
ko: 현재 문장 다시 재생
pt_br: Repetir a frase atual
zh_hans: 重播本句
zh_hant: 重播本句

# ytvideo_player.retry_local_service
source: Retry Local Playback
ar: إعادة محاولة التشغيل المحلي
de: Lokale Wiedergabe erneut versuchen
es: Reintentar reproducción local
fr: Réessayer la lecture locale
ja: ローカル再生を再試行
ko: 로컬 재생 다시 시도
pt_br: Tentar reprodução local novamente
zh_hans: 重试本地播放
zh_hant: 重試本機播放

# ytvideo_player.retry_subtitle_translation
source: Retry subtitle translation
ar: أعد محاولة ترجمة الترجمة
de: Untertitelübersetzung erneut versuchen
es: Reintentar la traducción de subtítulos
fr: Réessayer la traduction des sous-titres
ja: 字幕翻訳を再試行してください
ko: 자막 번역 다시 시도
pt_br: Tentar novamente a tradução das legendas
zh_hans: 重试字幕翻译
zh_hant: 重試字幕翻譯

# ytvideo_player.retryable_subtitles
source: Retryable subtitles
ar: ترجمات قابلة لإعادة المحاولة
de: Wiederholbare Untertitel
es: Subtítulos reintentables
fr: Sous-titres réessayables
ja: 再試行可能な字幕
ko: 재시도 가능한 자막
pt_br: Legendas repetíveis
zh_hans: 可重试字幕
zh_hant: 可重試字幕

# ytvideo_player.retrying
source: Retrying
ar: إعادة المحاولة
de: Erneuter Versuch
es: Reintentando
fr: Réessayer
ja: 再試行中
ko: 재시도 중
pt_br: Tentando novamente
zh_hans: 重试中
zh_hant: 重試中

# ytvideo_player.settings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
fr: Réglages
ja: 設定
ko: 설정
pt_br: Ajustes
zh_hans: 设置
zh_hant: 設定

# ytvideo_player.shadowing
source: Shadowing
ar: الترديد
de: Nachsprechen
es: Repetición guiada
fr: Répétition orale
ja: シャドーイング
ko: 쉐도잉
pt_br: Repetição guiada
zh_hans: 跟读
zh_hant: 跟讀

# ytvideo_player.single_sentence_repeat
source: Repeat sentence
ar: تكرار الجملة
de: Satz wiederholen
es: Repetir frase
fr: Répéter la phrase
ja: 文をリピート
ko: 문장 반복
pt_br: Repetir frase
zh_hans: 单句循环
zh_hant: 單句循環

# ytvideo_player.subtitle_status
source: subtitle status
ar: حالة الترجمة
de: Untertitelstatus
es: estado de los subtítulos
fr: statut des sous-titres
ja: 字幕ステータス
ko: 자막 상태
pt_br: status da legenda
zh_hans: 字幕状态
zh_hant: 字幕狀態

# ytvideo_player.subtitle_translation
source: Subtitle translation
ar: ترجمة الترجمة
de: Untertitelübersetzung
es: Traducción de subtítulos
fr: Traduction des sous-titres
ja: 字幕翻訳
ko: 자막 번역
pt_br: Tradução de legendas
zh_hans: 字幕翻译
zh_hant: 字幕翻譯

# ytvideo_player.subtitle_translation_progress
source: Subtitle translation progress
ar: تقدم ترجمة الترجمة
de: Fortschritt der Untertitelübersetzung
es: Progreso de la traducción de subtítulos
fr: Progression de la traduction des sous-titres
ja: 字幕翻訳の進捗状況
ko: 자막 번역 진행 상황
pt_br: Progresso da tradução das legendas
zh_hans: 字幕翻译进度
zh_hant: 字幕翻譯進度

# ytvideo_player.subtitles
source: subtitles
ar: ترجمات
de: Untertitel
es: subtítulos
fr: sous-titres
ja: 字幕
ko: 자막
pt_br: legendas
zh_hans: 字幕
zh_hant: 字幕

# ytvideo_player.subtitles_bilingual
source: Bilingual
ar: ثنائي اللغة
de: Zweisprachig
es: Bilingüe
fr: Bilingue
ja: バイリンガル
ko: 이중 언어
pt_br: Bilíngue
zh_hans: 双语
zh_hant: 雙語

# ytvideo_player.subtitles_disabled
source: Subtitles are off
ar: الترجمة متوقفة
de: Untertitel sind aus
es: Los subtítulos están desactivados
fr: Les sous-titres sont désactivés
ja: 字幕はオフです
ko: 자막이 꺼져 있습니다
pt_br: As legendas estão desativadas
zh_hans: 字幕已关闭
zh_hant: 字幕已關閉

# ytvideo_player.subtitles_english_only
source: English only
ar: الإنجليزية فقط
de: Nur Englisch
es: Solo inglés
fr: Anglais uniquement
ja: 英語のみ
ko: 영어만
pt_br: Somente inglês
zh_hans: 仅英文
zh_hant: 僅英文

# ytvideo_player.subtitles_not_available
source: Subtitles not available
ar: الترجمات غير متوفرة
de: Untertitel nicht verfügbar
es: Subtítulos no disponibles
fr: Sous-titres non disponibles
ja: 字幕は利用できません
ko: 자막을 사용할 수 없습니다.
pt_br: Legendas não disponíveis
zh_hans: 字幕不可用
zh_hant: 字幕不可用

# ytvideo_player.subtitles_off
source: Off
ar: إيقاف
de: Aus
es: Desactivado
fr: Désactivé
ja: オフ
ko: 끄기
pt_br: Desativado
zh_hans: 关闭
zh_hant: 關閉

# ytvideo_player.the_english_subtitles_have_been_saved_and_the_translation_will_b
source: The English subtitles have been saved and the translation will be tried again.
ar: تم حفظ الترجمة الإنجليزية وستتم محاولة الترجمة مرة أخرى.
de: Die englischen Untertitel wurden gespeichert und die Übersetzung wird erneut versucht.
es: Los subtítulos en inglés se han guardado y se intentará nuevamente la traducción.
fr: Les sous-titres anglais ont été enregistrés et la traduction sera réessayée.
ja: 英語の字幕が保存され、翻訳が再試行されます。
ko: 영어 자막은 저장되었으며 번역을 다시 시도하겠습니다.
pt_br: As legendas em inglês foram salvas e a tradução será tentada novamente.
zh_hans: 英文字幕已保存，翻译待重试
zh_hant: 英文字幕已儲存，翻譯待重試

# ytvideo_player.translate_subtitles
source: Translate subtitles
ar: ترجمة ترجمات
de: Untertitel übersetzen
es: Traducir subtítulos
fr: Traduire les sous-titres
ja: 字幕を翻訳する
ko: 자막 번역
pt_br: Traduzir legendas
zh_hans: 翻译字幕
zh_hant: 翻譯字幕

# ytvideo_player.translating
source: Translating
ar: ترجمة
de: Übersetzen
es: Traduciendo
fr: Traduire
ja: 翻訳中
ko: 번역 중
pt_br: Traduzindo
zh_hans: 翻译中
zh_hant: 翻譯中

# ytvideo_player.translating_subtitles_in_llm
source: Translating subtitles in LLM
ar: ترجمة الترجمة في LLM
de: Untertitel in LLM übersetzen
es: Traduciendo subtítulos en LLM
fr: Traduction des sous-titres dans LLM
ja: LLM の字幕を翻訳しています
ko: LLM에서 자막 번역
pt_br: Traduzindo legendas em LLM
zh_hans: 正在 LLM 翻译字幕
zh_hant: 正在 LLM 翻譯字幕

# ytvideo_player.view_retranslation_restrictions
source: View retranslation restrictions
ar: عرض قيود إعادة الترجمة
de: Einschränkungen für die Neuübersetzung anzeigen
es: Ver restricciones de retraducción
fr: Afficher les restrictions de retraduction
ja: 再翻訳の制限を表示する
ko: 재번역 제한 사항 보기
pt_br: Ver restrições de retradução
zh_hans: 查看重转写限制
zh_hant: 查看重寫寫限制

# ytvideo_player.view_translation_progress
source: View translation progress
ar: عرض تقدم الترجمة
de: Übersetzungsfortschritt anzeigen
es: Ver el progreso de la traducción
fr: Afficher la progression de la traduction
ja: 翻訳の進行状況を表示する
ko: 번역 진행 상황 보기
pt_br: Ver o progresso da tradução
zh_hans: 查看翻译进度
zh_hant: 看翻譯進度

# settings.local_media_base_url
source: Base URL (https://…)
de: Basis-URL (https://…)
es: URL base (https://…)
fr: URL de base (https://…)
pt_br: URL base (https://…)

# settings.local_media_token
source: Bearer token
es: Token Bearer
fr: Jeton Bearer
ko: Bearer 토큰
pt_br: Token Bearer

# assistant.playback.missing_feed
source: This podcast episode is missing a feed URL.
zh_hans: 该播客单集缺少订阅源地址。
zh_hant: 此 Podcast 單集缺少訂閱源網址。

# assistant.playback.missing_job
source: This source is not ready to play yet.
zh_hans: 该来源还不能播放。
zh_hant: 此來源尚無法播放。

# assistant.playback.not_configured
source: The cloud transcription service is not configured.
zh_hans: 尚未配置云端转写服务。
zh_hant: 尚未設定雲端轉寫服務。

# assistant.playback.unsupported
source: This source type cannot be opened in the player.
zh_hans: 此来源类型无法在播放器中打开。
zh_hant: 此來源類型無法在播放器中打開。

# error.missing_asr_configuration
source: Add a DashScope ASR API key in Settings first.
zh_hans: 请先在设置中添加 DashScope ASR API Key。
zh_hant: 請先在設定中新增 DashScope ASR API Key。

# ytvideo_player.audio_asr_iphone_only
source: Audio subtitle generation is only available on iPhone.
zh_hans: 仅 iPhone 支持使用音频生成字幕。
zh_hant: 僅 iPhone 支援使用音訊產生字幕。
